<p>自作プロフィールサイトです。昔あった前略プロフィールみたいなものです。</p>
<p>ログインされる場合、以下のアカウントを使ってください。</p>
<ul>
    <li>メールアドレス：user001@test.com</li>
    <li>パスワード：user001</li>
</ul>
<p>ぜひサインインもお願いします！ただ保護されていない通信のため、上記のユーザーを参考にダミーのアカウントを作ってください。</p>


<p>サイトのアピールしたいところ</p>
<ul>
    <li>ログアウト状態でも（アカウントを持ってなくても）、プロフィール閲覧可能</li>
    <li>ストレージはS3を利用。自身の画像を追加した場合、古い画像は削除されます</li>
    <li>アカウント生成すると同時にサンプルプロフィールを生成</li>
</ul>
<p>以下ブラッシュアップしていきたいところ</p>
<ul>
    <li>プロフィール画像の表示が遅いので、圧縮して保存できるように</li>
    <li>Ajaxを使ってプロフィール追加がサイト移動できるように</li>
    <li>HTTPSも対応しているが、ページ移動でHTTPになってしまうため、.htaccessの編集</li>
</ul>

<p>セキュリティの面で対応ができていないので、まだ公開はできません。</p>